import random

class PlaceGen:
    def __init__(self):
        self.places = ["Стадион Труд", "Стадион Северный", "Стадион Нижний Новгород", "Поселок", "Реактор", "ФОК", "Полигон", "Парк", "Сантьяго Бернабеу", "Камп Ноу", "Лес", "Пляж", "Музей", "Зоопарк", "Магазин", "Вокзал", "Бар", "Рынок", "Мост", "Банк", "Храм", "Заповедник", "Фонтан", "Аквапарк", "Офис", "Монастырь", "Театр", "Корт", "Бассейн", "Молл"]
        self.adjectives1 = ["Забытый", "Великий", "Переоцененный", "Мертвый", "Старый", "Огромный", "Новый", "Страшный", "Уютный", "Туманный", "Загрязненный", "Религиозный", "Древний", "Умиротворенный", "Холмистый", "Южный", "Северный", "Восточный", "Западный", "Волшебный", "Солнечный", "Ветреный", "Жаркий", "Морской", "Горный", "Речной", "Каменистый", "Пустынный", "Обжитый", "Восточноевропейский", "Траурный", "Орлиный", "Долинный", "Железнодорожный", "Элитный", "Космический"]
    
    def generate_random_place(self):
        random_place = random.choice (self.places)
        random_adjective1 = random.choice (self.adjectives1)
        return f"{random_adjective1} {random_place}"
    
class NameGen:
    def __init__(self):
        self.names = ["Мажоры", "Упыри", "Бедолаги", "Борцухи", "Легкие курильщика", "Жуки", "Смурфы", "Гении", "Лудоманы", "Профессионалы", "Парни", "Линуксоводы", "Приспособленцы", "Нефоры", "Спортики", "Лодыри", "Либерахи", "Питонисты", "Рабочие", "Бродяги", "Жулики", "Табуретки", "Вши", "Пассатижи", "Молотки", "Персики", "Буйволы", "Садовники", "Модельеры", "Воители", "Капитаны", "Начальники", "Философы", "Наставники", "Моряки", "Инспекторы", "Механики", "Дворники", "Соседи", "Мужчины", "Артисты", "Трактористы", "Писатели", "Хакеры", "Программисты" , "Плотники", "Коллеги", "Подростки", "Атлеты"]
        self.adjectives2 = ["Взорванные", "Заряженные", "Неуверенные", "Летучие", "Странные", "Напуганные", "Липкие", "Убитые", "Красивые", "Щедрые", "Энергичные", "Вежливые", "Общительные", "Порядочные", "Мудрые", "Доступные", "Безмятежные", "Активные", "Опытные", "Позитивные", "Гармоничные", "Спонтанные", "Заботливые", "Амбициозные", "Терпеливые", "Невинные", "Преданные", "Успешные", "Изысканные", "Разносторонние", "Первоклассные", "Честные"]

    def generate_random_place(self):
        random_name = random.choice (self.names)
        random_adjective2 = random.choice (self.adjectives2)
        return f"{random_adjective2} {random_name}"